In [0]:
#import packages 

import pandas as pd
import numpy as np
from sklearn import linear_model
import sklearn.metrics as metrics
import matplotlib.pyplot as plt
from sklearn.neighbors import NearestNeighbors

In [23]:
#read in data
data = pd.read_csv('https://github.com/ArinB/CA05-kNN/raw/master/movies_recommendation_data.csv')

#look at first few records
data.head(10)

ERROR! Session/line number was not unique in database. History logging moved to new session 59

   Movie ID           Movie Name  IMDB Rating  ...  Mystery  History  Label
0        58   The Imitation Game          8.0  ...        0        0      0
1         8           Ex Machina          7.7  ...        1        0      0
2        46     A Beautiful Mind          8.2  ...        0        0      0
3        62    Good Will Hunting          8.3  ...        0        0      0
4        97         Forrest Gump          8.8  ...        0        0      0
5        98                   21          6.8  ...        0        1      0
6        31               Gifted          7.6  ...        0        0      0
7         3  Travelling Salesman          5.9  ...        1        0      0
8        51               Avatar          7.9  ...        0        0      0
9        47       The Karate Kid          7.2  ...        0        0      0

[10 rows x 11 columns]

In [24]:
data.info()
data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 11 columns):
Movie ID       30 non-null int64
Movie Name     30 non-null object
IMDB Rating    30 non-null float64
Biography      30 non-null int64
Drama          30 non-null int64
Thriller       30 non-null int64
Comedy         30 non-null int64
Crime          30 non-null int64
Mystery        30 non-null int64
History        30 non-null int64
Label          30 non-null int64
dtypes: float64(1), int64(9), object(1)
memory usage: 2.7+ KB

        Movie ID  IMDB Rating  Biography  ...    Mystery    History  Label
count  30.000000    30.000000  30.000000  ...  30.000000  30.000000   30.0
mean   48.133333     7.696667   0.233333  ...   0.100000   0.100000    0.0
std    29.288969     0.666169   0.430183  ...   0.305129   0.305129    0.0
min     1.000000     5.900000   0.000000  ...   0.000000   0.000000    0.0
25%    27.750000     7.300000   0.000000  ...   0.000000   0.000000    0.0
50%    48.500000     7.750000   0.000000  ...   0.000000   0.000000    0.0
75%    64.250000     8.175000   0.000000  ...   0.000000   0.000000    0.0
max    98.000000     8.800000   1.000000  ...   1.000000   1.000000    0.0

[8 rows x 10 columns]

In [25]:
X = data.drop(['Movie Name','Movie ID','Label'], axis=1)
y= data['Movie Name']

neigh = NearestNeighbors(n_neighbors=5)
neigh.fit(X,y)

NearestNeighbors(algorithm='auto', leaf_size=30, metric='minkowski',
                 metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                 radius=1.0)

#Movie Recommender

In [26]:
#Setting up The post movie for recommendations

#IMDB Rating = 7.2
#Biography= Yes 
#Drama = Yes 
#Thriller = No 
#Comedy = No 
#Crime = No 
#Mystery = No 
#History = Yes

thepost = [7.2,1,1,0,0,0,0,1]
distance_n, indices_n = neigh.kneighbors([thepost])
print(indices_n)

[[28 27 29 16  2]]

In [27]:
for i in indices_n:
  print(data.iloc[i]['Movie Name'])

28    12 Years a Slave
27       Hacksaw Ridge
29      Queen of Katwe
16      The Wind Rises
2     A Beautiful Mind
Name: Movie Name, dtype: object